grblHAL/STM32F4xx/Src/driver.c
#endif // AUX_CONTROLS_ENABLED


    return signals;
}

#if AUX_CONTROLS_ENABLED

static void aux_irq_handler (uint8_t port, bool state)
{
    uint_fast8_t i;
    control_signals_t signals = {0};

    for(i = 0; i < AuxCtrl_NumEntries; i++) {
        if(aux_ctrl[i].port == port) {
            if(!aux_ctrl[i].debouncing) {
                if(i == AuxCtrl_SafetyDoor) {
                    if((debounce.door = aux_ctrl[i].debouncing = debounce_start()))
                        break;
                }
                signals.mask |= aux_ctrl[i].cap.mask;
                if(aux_ctrl[i].irq_mode == IRQ_Mode_Change)
                    signals.deasserted = hal.port.wait_on_input(Port_Digital, aux_ctrl[i].port, WaitMode_Immediate, 0.0f) == 0;
            }
            break;
        }
    }

    if(signals.mask) {
        if(!signals.deasserted)
            signals.mask |= systemGetState().mask;
        hal.control.interrupt_callback(signals);
    }
}

static bool aux_attach (xbar_t *properties, aux_ctrl_t *aux_ctrl)
{
    bool ok;
    uint_fast8_t i = sizeof(inputpin) / sizeof(input_signal_t);

    do {
        i--;
        if((ok = (void *)inputpin[i].port == properties->port && inputpin[i].pin == properties->pin)) {
            inputpin[i].aux_ctrl = aux_ctrl;
            break;
        }
    } while(i);

    return ok;
}

static bool aux_claim (xbar_t *properties, uint8_t port, void *data)
{
    bool ok;

    ((aux_ctrl_t *)data)->port = port;

    if((ok = ioport_claim(Port_Digital, Port_Input, &((aux_ctrl_t *)data)->port, xbar_fn_to_pinname(((aux_ctrl_t *)data)->function))))
        aux_attach(properties, (aux_ctrl_t *)data);

    return ok;
}

#if AUX_CONTROLS_XMAP

static bool aux_claim_explicit (aux_ctrl_t *aux_ctrl)
{
    if((aux_ctrl->enabled = aux_ctrl->port != 0xFF && ioport_claim(Port_Digital, Port_Input, &aux_ctrl->port, xbar_fn_to_pinname(aux_ctrl->function)))) {
        hal.signals_cap.mask |= aux_ctrl->cap.mask;
        aux_attach(hal.port.get_pin_info(Port_Digital, Port_Input, aux_ctrl->port), aux_ctrl);
    } else
        aux_ctrl->port = 0xFF;

    return aux_ctrl->enabled;
}

#endif

#endif // AUX_CONTROLS_ENABLED

#ifdef PROBE_PIN

// Toggle probe connected status. Used when no input pin is available.
static void probeConnectedToggle (void)
{
    probe.connected = !probe.connected;
}

// Sets up the probe pin invert mask to
// appropriately set the pin logic according to setting for normal-high/normal-low operation
// and the probing cycle modes for toward-workpiece/away-from-workpiece.
static void probeConfigure (bool is_probe_away, bool probing)
{
    probe.inverted = is_probe_away ? !settings.probe.invert_probe_pin : settings.probe.invert_probe_pin;
#if PROBE_IRQ_BIT
    probe.triggered = hal.probe.get_state().triggered;
    gpio_irq_enable(probe_input, probing && !probe.triggered ? (probe.inverted ? IRQ_Mode_Falling : IRQ_Mode_Rising) : IRQ_Mode_None);
#else
    probe.triggered = Off;
#endif
    probe.is_probing = probing;
}

// Returns the probe connected and triggered pin states.
static probe_state_t probeGetState (void)
{
    probe_state_t state = {0};

    state.connected = probe.connected;
#if PROBE_IRQ_BIT
    state.triggered = probe.is_probing ? probe.triggered : DIGITAL_IN(PROBE_PORT, PROBE_PIN) ^ probe.inverted;
#else
    state.triggered = DIGITAL_IN(PROBE_PORT, PROBE_PIN) ^ probe.inverted;
#endif
    return state;
}

#endif // PROBE_PIN

#if DRIVER_SPINDLE_ENABLE

// Static spindle (off, on cw & on ccw)

inline static void spindle_off (void)
{
    DIGITAL_OUT(SPINDLE_ENABLE_PORT, SPINDLE_ENABLE_PIN, settings.spindle.invert.on);
}

inline static void spindle_on (spindle_ptrs_t *spindle)
{
    DIGITAL_OUT(SPINDLE_ENABLE_PORT, SPINDLE_ENABLE_PIN, !settings.spindle.invert.on);
#if SPINDLE_ENCODER_ENABLE
    if(spindle && spindle->reset_data)
        spindle->reset_data();
#endif
}

inline static void spindle_dir (bool ccw)
{
#ifdef SPINDLE_DIRECTION_PIN
    DIGITAL_OUT(SPINDLE_DIRECTION_PORT, SPINDLE_DIRECTION_PIN, ccw ^ settings.spindle.invert.ccw);
#else
    UNUSED(ccw);
#endif
}

// Start or stop spindle
static void spindleSetState (spindle_ptrs_t *spindle, spindle_state_t state, float rpm)
{
    if(!state.on)
        spindle_off();
    else {
        spindle_dir(state.ccw);
        spindle_on(spindle);
    }
}

// Variable spindle control functions

#if DRIVER_SPINDLE_PWM_ENABLE

// Sets spindle speed
static void spindleSetSpeed (spindle_ptrs_t *spindle, uint_fast16_t pwm_value)
{
    if(pwm_value == pwm(spindle)->off_value) {
        pwmEnabled = false;
        if(pwm(spindle)->settings->flags.enable_rpm_controlled) {
            if(pwm(spindle)->cloned)
                spindle_dir(false);
            else
                spindle_off();
        }
        if(pwm(spindle)->always_on) {
            SPINDLE_PWM_TIMER_CCR = pwm(spindle)->off_value;
#if SPINDLE_PWM_TIMER_N == 1
            SPINDLE_PWM_TIMER->BDTR |= TIM_BDTR_MOE;
#endif
            SPINDLE_PWM_TIMER_CCR = pwm_value;
        } else
#if SPINDLE_PWM_TIMER_N == 1
            SPINDLE_PWM_TIMER->BDTR &= ~TIM_BDTR_MOE; // Set PWM output low
#else
            SPINDLE_PWM_TIMER_CCR = 0;
#endif
    } else {
        if(!pwmEnabled) {
            if(pwm(spindle)->cloned)
                spindle_dir(true);
            else
                spindle_on(spindle);
            pwmEnabled = true;
        }
        SPINDLE_PWM_TIMER_CCR = pwm_value;
#if SPINDLE_PWM_TIMER_N == 1
        SPINDLE_PWM_TIMER->BDTR |= TIM_BDTR_MOE;
#endif
    }
}

static uint_fast16_t spindleGetPWM (spindle_ptrs_t *spindle, float rpm)
{
    return pwm(spindle)->compute_value(pwm(spindle), rpm, false);
}

// Start or stop spindle
static void spindleSetStateVariable (spindle_ptrs_t *spindle, spindle_state_t state, float rpm)
{
#ifdef SPINDLE_DIRECTION_PIN
    if(state.on || pwm(spindle)->cloned)
        spindle_dir(state.ccw);
#endif
    if(!pwm(spindle)->settings->flags.enable_rpm_controlled) {
        if(state.on)
            spindle_on(spindle);
        else
            spindle_off();
    }

